package edu.cesspool.metanit.chapter1_intro
/**
 * Урок 1: Что такое Kotlin и первая программа
 * Дата: 2025.12.08
 * Источник: metanit.com
 */


/* Kotlin/Native позволяет писать приложения, которые компилируются в
* нативный код и которые выполняются без JVM.
* */

/*
* В принципе вводный урок. В котором рассказывается что котлин не просто язык
* программирования, а в некотором понимании целая экосистема (чуть я привел
* небольшую выписку про котлин-натив, которая показалась мне интересной), а
* в целом была информация общего характера, о том, что разработка языка
* началась в 2010 году, первый официальный релиз был 15 февраля 2016 года.
* И была инфа о том, где скачать компилятор и как его запустить из терминала
* на винде.
* */