package edu.cesspool.metanit.chapter4_objectOrientedProgramming

// про пакеты я думаю все понятно. написано выше
// вроде как имя пакета может быть любым
//
// но принято делать как в яве - название пакета повторяет путь директории файла где пакет находится

// у пакета одно пространство имен и не нужно в нем создавать функций с одинаковыми именами и параметрами


// импорты
// если импорт с точкой, то импортируются все функции и классы с данного пакета

// можно импортировать конкретные функции или классы

// можно их импортировать и дать псевдоним с помощью ключевого слова as:
//
// import email.send as sendEmail


// встроенные пакеты
// пакеты которые подключены по дефолту
/**
 *
 *
 *     kotlin.*
 *
 *     kotlin.annotation.*
 *
 *     kotlin.collections.*
 *
 *     kotlin.comparisons.*
 *
 *     kotlin.io.*
 *
 *     kotlin.ranges.*
 *
 *     kotlin.sequences.*
 *
 *     kotlin.text.*
 *
 *
 *
 * */