package edu.cesspool.another.summArchitecture

/**
 * Пытался слушать лекции на ютубе об архитектуре приложения. Не нашел легкую и подходящую к моему недосыпу.
 * А вообще конечно могу сказать, что архитектура это очень важно и именно важно на начальном этапе написания приложения
 * потому что когда приложение растет в объеме, его сложность растет экспоненциально. Это значит, что если для
 * добавления определенной фичи в начале пути нужно затратить условный час времени в легком режиме, то если мы будем
 * добавлять этот же функционал через пару месяцев, а еще и при какой-нибудь неправильной архитектуре (или вообще
 * при отсутствии таковой), то это займет у нас в разы больше времени и сил. А возможно, повторюсь, если у нас вообще
 * не выстроено архитектуры, то это будет в принципе невозможно при нашем уровне скилов.
 * */