package edu.cesspool.metanit.chapter5_generics

//-------------------------------------------------
//                                                -
//          В а р и а н т н о с т ь,              -
//                                                -
//        к о в а р и а н т н о с т ь             -
//                                                -
//       к о н т р а в а р и а н т н о с т ь      -
//                                                -
//-------------------------------------------------


